app/Controllers/Customers.php

SELECT *
FROM `customers`
---
    public function index()
    {
        $model = new CustomerModel();

        $data = [
            'customers' => $model->findAll()
        ];

INSERT INTO `customers` (`full_name`, `email`, `phone`) VALUES ('Jona Santos', 'jsantos@gmail.com', '09323453322')
---
    public function create()
    {
        $rules = [
            'full_name' => 'required',
            'email' => 'required|valid_email',
            'phone' => 'regex_match[/^\+?[0-9\s\-]{7,15}$/]|permit_empty'
        ];
        if (!$this->validate($rules)){
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());;
        }
        $model = new CustomerModel();
        $model->insert([
            'full_name'=>$this->request->getPost('full_name'),
            'email'=>$this->request->getPost('email'),
            'phone'=>$this->request->getPost('phone')
        ]);

SELECT *
FROM `customers`
WHERE `customers`.`id` = '1'
---
    public function edit($id = null)
    {
        $model = new CustomerModel();
        $customer = $model->find($id);