app/Controllers/Users.php

    public function index()
    {
        $model = new UserModel();

        $data = [
            'users' => $model->findAll()
        ];
---
SELECT *
FROM `users`

            ->fit(300, 300, 'center')
            ->save(FCPATH . 'uploads/' . $newName);

        $model->insert([
            'username' => $this->request->getPost('username'),
            'full_name' => $this->request->getPost('full_name'),
            'password'  => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'avatar' => $newName
        ]);
---
INSERT INTO `users` (`username`, `full_name`, `password`, `avatar`) VALUES ('NozasJ', 'John Benedict Sazon', '$2y$10$41iTL1gl.OUHouqCEEX4jOqNbEG7O4k4ZQFkTgFvT0p9tZJJUius.', '1791347300_5466ba104a197d42a463.png')

    public function edit($id = null)
    {
        $model = new UserModel();
        $user = $model->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

    public function update($id = null){
    $model = new UserModel();

    if (! $model->find($id)) {
---
SELECT *
FROM `users`
WHERE `users`.`id` = '8'

            @unlink($uploadPath . '/' . basename($oldAvatar));
        }

        $model->update($id, [
            'username' => $username,
            'full_name' => $full_name,
            'avatar' => $newName
        ]);
---
UPDATE `users` SET `username` = 'Ralph', `full_name` = 'Baterb', `avatar` = '1791305678_35b98019acda37a05ed5.png'
WHERE `users`.`id` IN ('8')